{
  "users": [
    {
      "id": "_b67bcbf5ccd12",
      "login": "user@ya.ru",
      "password": "123456",
      "role": "writer"
    }
  ],
  "posts": [
    {
      "id": "efaf10",
      "title": "Что такое npm и что такое пакеты ?",
      "description": "Буквы npmобозначают «менеджер пакетов узлов». Когда вы работаете над проектом JavaScript, вы можете использовать npm для установки пакетов кода других людей в ваш собственный проект. Ваш проект может быть веб-проектом, таким как веб-сайт или веб-приложение, или это может быть серверный проект, использующий узел. Любой проект JavaScript может использовать npm для добавления пакетов существующего кода.\nNpm - это инструмент, который вы устанавливаете на свой компьютер. Это часть узла, поэтому установить версию LTS Узла , чтобы получить как nodeи npmкоманды в командной строке. Он должен быть установлен на каждом компьютере, где вы хотите работать над своим проектом, поэтому, если вы перемещаете свои файлы с помощью USB-накопителя, не забудьте эту часть!\nВы используете npm из командной строки для установки, удаления или обновления пакетов. Под «пакетом» я подразумеваю любой фрагмент кода, который кто-то решил опубликовать на npm.\nНекоторые примеры пакетов npm:\nугловатый\nреагировать\nJQuery\nЭкспресс\nSocket.io\nНа npm опубликованы тысячи пакетов. Вы можете просмотреть их на npmjs.com , но обычно вы можете найти рекомендуемые пакеты, выполнив поиск в Google или следуя сообщениям в блоге. Некоторые пакеты подходят только для веб-проектов, а некоторые - только для узловых проектов.",
      "claps": 0,
      "createdAt": "2020-04-01T17:07:58.867Z",
      "updateAt": "2020-04-12T12:43:50.256Z",
      "userId": "_b67bcbf5ccd12"
    },
    {
      "id": "1b14f6b",
      "title": "Docker",
      "description": "Docker — программное обеспечение для автоматизации развёртывания и управления приложениями в средах с поддержкой контейнеризации. Позволяет «упаковать» приложение со всем его окружением и зависимостями в контейнер, который может быть перенесён на любую Linux-систему с поддержкой cgroups в ядре, а также предоставляет среду по управлению контейнерами. Изначально использовал возможности LXC, с 2015 года применял собственную библиотеку, абстрагирующую виртуализационные возможности ядра Linux — libcontainer. С появлением ​Open Container Initiative начался переход от монолитной к модульной архитектуре.\n\nРазрабатывается и поддерживается одноимённой компанией-стартапом, распространяется в двух редакциях — общественной (Community Edition) по лицензии Apache 2.0 и для организаций (Enterprise Edition) по проприетарной лицензии. Написан на языке Go.",
      "claps": 0,
      "createdAt": "2020-04-12T12:45:08.160Z",
      "updateAt": null,
      "userId": "_b67bcbf5ccd12"
    }
  ]
}